-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 11 2024 г., 17:43
-- Версия сервера: 10.8.4-MariaDB
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `yookassa2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `category_id` bigint(20) UNSIGNED DEFAULT NULL,
  `draft` tinyint(1) NOT NULL DEFAULT 0,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `desc` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `SKU` varchar(127) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `brand` varchar(127) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `price` decimal(10,2) DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `discount_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `category_id`, `draft`, `name`, `desc`, `SKU`, `brand`, `price`, `image`, `discount_id`, `created_at`, `updated_at`) VALUES
(21, 1, 0, '2602', 'Отделка-ORO BRILLO Y MATE. Настольные лампы.', NULL, 'Almerich', '140.00', '6423.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(22, 1, 0, '2632', 'Отделка-ORO BRILLO Y MATE. Настольные лампы.', NULL, 'Almerich', '190.00', '6424.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(23, 1, 0, '2003', 'Отделка-ORO SEVILLA. Настольные лампы.', NULL, 'Almerich', '300.00', '6425.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(24, 1, 0, '2379', 'Отделка-PLATA MATE. Настольные лампы.', NULL, 'Almerich', '300.00', '6426.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(25, 2, 0, 'Lisa 6980', 'Муранское стекло. Цвет-arancio liquido. Цвет абажура- nero. Отделка- темный хром.. Настольные лампы.', NULL, 'Barovier', '240.00', '5862.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(26, 2, 0, '1596', 'Флорентийский хрусталь. Абажур-шелк. Настольные лампы. Двойной переключатель Двойной переключатель', NULL, 'Il Paralume Marina', '360.00', '6310.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(27, 2, 0, '1744 G ORO 24K', 'Отделка-Oro 24K кристаллы Swarovski. Абажуры-шёлк шифон. Настольные лампы.', NULL, 'Il Paralume Marina', '120.00', '6311.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(28, 2, 0, '1638/AM/LU + 1638/KR/NR', 'Муранское стекло Абажур. Настольные лампы.', NULL, 'Il Paralume Marina', '180.00', '6312.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(29, 2, 0, '1747/P/OV', 'Флорентийский хрусталь. Абажур-шифон. Настольные лампы.', NULL, 'Il Paralume Marina', '330.00', '6313.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(30, 2, 0, '1848', 'Флорентийский хрусталь. Абажур-шелк. Настольные лампы.', NULL, 'Il Paralume Marina', '100.00', '6315.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(31, 2, 0, '1850/FO/RO', 'Муранское стекло хрусталь. Абажур-двухслойная ткань:золотая лайкра внутри и шелк снаружи. Настольные лампы.', NULL, 'Il Paralume Marina', '90.00', '6316.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(32, 1, 0, '1873/G', 'Настольные лампы.', NULL, 'Il Paralume Marina', '220.00', '6320.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(33, 1, 0, '1943/NN/AM', 'Отделка-черный никель янтарный флорентийский хрусталь. Настольные лампы.', NULL, 'Il Paralume Marina', '100.00', '6322.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(34, 1, 0, '1946/NL/VE', 'Отделка-полированный никель светло-зеленый итальянский хрусталь. Настольные лампы. Двойной переключатель Двойной переключатель', NULL, 'Il Paralume Marina', '99.99', '6324.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(35, 3, 0, '1954/G', 'Муранское стекло. Полированное золото. Настольные лампы.', NULL, 'Il Paralume Marina', '300.00', '6328.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(36, 3, 0, '2086/LU', 'Полированное золото. Настольные лампы.', NULL, 'Il Paralume Marina', '230.00', '6330.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(37, 1, 0, '2087', 'Муранское стекло. Полированный никель. Настольные лампы.', NULL, 'Il Paralume Marina', '100.00', '6331.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(38, 1, 0, '2088', 'Муранское стекло. Полированный никель. Настольные лампы.', NULL, 'Il Paralume Marina', '130.00', '6332.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(39, 1, 0, '2089', 'Муранское стекло. Полированный никель. Настольные лампы.', NULL, 'Il Paralume Marina', '420.00', '6333.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(40, 3, 0, '5751', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '440.00', '2964.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(41, 3, 0, '5739', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '150.00', '2965.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(42, 1, 0, '5615', 'Латунь фарфор ткань стекло. Настольные лампы. Классический', NULL, 'Le Porcellane', '350.00', '2966.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(44, 3, 0, '3502', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '170.00', '2970.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(45, 3, 0, '3516', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '180.00', '2971.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(46, 3, 0, '5477', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '100.00', '2972.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(47, 3, 0, '2447', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '551.00', '2973.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(48, 3, 0, '5464/BO', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Le Porcellane', '170.00', '2982.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(49, 3, 0, '2863', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '140.00', '2980.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(50, 3, 0, '5660/S', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '100.00', '2981.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(51, 3, 0, '5374', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Le Porcellane', '200.00', '2983.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(52, 3, 0, '5370', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Le Porcellane', '170.00', '2984.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(53, 3, 0, '5586', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '200.00', '2985.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(54, 3, 0, '5584', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '300.00', '2986.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(55, 3, 0, '2868', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Il Paralume Marina', '100.00', '2987.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(56, 3, 0, '2568', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Le Porcellane', '100.00', '2988.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(57, 3, 0, '2560', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Le Porcellane', '70.00', '2989.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(58, 3, 0, '5579', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Le Porcellane', '200.00', '2990.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(59, 3, 0, '5578', 'Латунь фарфор полимер. Настольные лампы. Классический', NULL, 'Le Porcellane', '110.00', '2991.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(60, 3, 0, '2872', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '114.00', '3004.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(61, 3, 0, '5705', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '210.00', '2974.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(62, 3, 0, '3423', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '100.00', '2975.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(63, 3, 0, '5691', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '100.00', '2978.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(64, 3, 0, '3649', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '130.00', '2976.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(65, 3, 0, '4343', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '360.00', '2977.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(66, 3, 0, '4809', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '170.00', '2963.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(67, 1, 0, '4999', 'Латунь фарфор ткань стекло. Настольные лампы. Классический', NULL, 'Le Porcellane', '230.00', '2969.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(68, 1, 0, '5026', 'Латунь фарфор ткань стекло. Настольные лампы. Классический', NULL, 'Le Porcellane', '500.00', '2967.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(69, 1, 0, '5753', 'Латунь фарфор ткань. Настольные лампы. Классический', NULL, 'Le Porcellane', '90.00', '2962.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(70, 1, 0, 'Warrior', 'Латунь. Настольные лампы. Классический', NULL, 'Ochre', '70.00', '3863.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(71, 1, 0, 'Portrait', 'Стекло бронза. Настольные лампы. Современный Современный', NULL, 'Ochre', '50.00', '3862.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(72, 1, 0, 'Scorpion Lamp Double Head', 'Стекло бронза. Настольные лампы. Классический', NULL, 'Ochre', '400.00', '3861.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(73, 1, 0, 'Lupin Lamp', 'Стекло бронза. Настольные лампы. Классический', NULL, 'Ochre', '300.00', '3860.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(74, 1, 0, 'PA 864', 'Настольные лампы. Классический Арт-Деко Классический Арт-Деко', NULL, 'Pieter Adam', '240.00', '3738.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(75, 1, 0, 'PA 873', 'Настольные лампы. Арт-Деко Арт-Деко', NULL, 'Pieter Adam', '230.00', '3739.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(76, 1, 0, 'PA 823', 'Настольные лампы. Классический Арт-Деко Классический Арт-Деко', NULL, 'Pieter Adam', '404.00', '3740.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(77, 1, 0, 'CL2057', 'Лампа из майолики расписаная вручную с латунными деталями и абажуром из желтого вельвета.. Настольные лампы. Дизайн Granchi Studio 2015 Дизайн Granchi Studio 2015', NULL, 'Sigma L2', '244.00', '7486.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(78, 1, 0, 'CL1673', 'Хромированная латунная настольная лампа в коже настоящего питона. Настольные лампы. Дизайн Simone Granchi 2001. PONY & PYTHON Дизайн Simone Granchi 2001. PONY & PYTHON', NULL, 'Sigma L2', '240.00', '7487.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(79, 1, 0, 'CL1852/AR', 'Лампа со стержнем полностью выгравирована из майолики покрыта платиной. Основание и детали из хромированной латуни. Абажур из серого шелкового атласа и серебряной ленты. Настольные лампы. Дизайн Simone Granchi 2007. BUBBLE Дизайн Simone Granchi 2007. BUBB', NULL, 'Sigma L2', '116.00', '7488.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(80, 1, 0, 'CL1862', 'Настольная лампа полностью выгравированная из майолики с эффектом \\таящей свечи\\. Украшена глазурью и платиной. База - блестящая черная лаковая древесина хромированные детали из латуни. Абажур черного цвета изнутри серебристый. Настольные лампы. Дизайн Si', NULL, 'Sigma L2', '56.00', '7489.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(81, 1, 0, 'CL1894', 'Лампа с хромированным и бронзовым составом средняя часть из латуни лакированной коричневой эмалью. Абажур из коричневого шелкового атласа.. Настольные лампы. Дизайн Simone Granchi 2008. ELFO Дизайн Simone Granchi 2008. ELFO', NULL, 'Sigma L2', '144.00', '7491.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(82, 1, 0, 'CL1918/AR', 'Лампа в ручной гравировке майолика покрытая античной платиной абажур в сером шелковом сатине. Настольные лампы. Дизайн Simone Granchi 2009. LACE COLLECTION Дизайн Simone Granchi 2009. LACE COLLECTION', NULL, 'Sigma L2', '360.00', '7492.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(83, 1, 0, 'CL1920', 'Лампа в блестящей белой лакированной древесине. Выгравированный вручную дракон в майолике античная платина. Настольные лампы. Дизайн Simone Granchi 2009. GRISOU’ COLLECTION Дизайн Simone Granchi 2009. GRISOU’ COLLECTION', NULL, 'Sigma L2', '80.00', '7493.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(84, 1, 0, 'CL1921', 'Лампа из майолики расписанная вручную и покрытая золотом. Основание из глянцевого черного лакированного дерева. Абажур- plisse nero. Настольные лампы. Дизайн Granchi Studio 2009. SETTECENTO Дизайн Granchi Studio 2009. SETTECENTO', NULL, 'Sigma L2', '360.00', '7494.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(85, 1, 0, 'CL1925', 'Лампа из майолики с бронзовым эффектом-эмаль нанесена вручную. Абажур из шелкового атласа с золотистым оттенком внутри.. Настольные лампы. Дизайн Simone Granchi 2009. PEDRO COLLECTION Дизайн Simone Granchi 2009. PEDRO COLLECTION', NULL, 'Sigma L2', '84.00', '7495.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(86, 1, 0, 'CL1929', 'Лампа из латуни и железа матовый хром. Камни в розовом кварце. Серый абажур из шелкового атласа. Настольные лампы. Дизайн Simone Granchi 2009 Дизайн Simone Granchi 2009', NULL, 'Sigma L2', '204.00', '7496.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(87, 1, 0, 'CL1950', 'Лампа из бронзового сплава с матовой хромированной отделкой и оловянными деталями. Абажур из красного шелка на черном фоне.. Настольные лампы. Дизайн Simone Granchi 2010 Дизайн Simone Granchi 2010', NULL, 'Sigma L2', '270.00', '7497.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(88, 1, 0, 'CL2025', 'Лампа из латуни и бронзы. Центральная часть состоит из металлического стержня покрытого шкурой пони в леопардовой окраске. Абажур изготовлен из натуральной латуни и стекла.. Настольные лампы. Дизайн Simone Granchi 2014 Дизайн Simone Granchi 2014', NULL, 'Sigma L2', '104.00', '7498.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(89, 1, 0, 'CL2026', 'Центральная часть лампы покрыта шкурой пони в леопардовой окраске необработанная деревянная база латунные детали и матовое золото / черная бронза. Бархатный абажур изнутри золотого цвета.. Настольные лампы. Дизайн Simone Granchi 2014 Дизайн Simone Granchi', NULL, 'Sigma L2', '110.00', '7499.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(90, 1, 0, 'CL2028', 'Бронзовая настольная лампа с хрустальной основой ручной работы. Абажур-Ivory velvet. Настольные лампы. Дизайн Simone Granchi 2014 Дизайн Simone Granchi 2014', NULL, 'Sigma L2', '48.00', '7500.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(91, 1, 0, 'CL2031', 'Лампа с латунным основанием и деталями хрустальный цилиндр с внутренней подсветкой. Абажур- Black chintz с золотом внутри.. Настольные лампы. Дизайн Simone Granchi 2014 Дизайн Simone Granchi 2014', NULL, 'Sigma L2', '280.00', '7501.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(92, 1, 0, 'CL2083/B', 'Настольная лампа в майолике ручной работы. Деревянное основание в черной лакированной отделке. Абажур -white linen внутри золото.. Настольные лампы. Дизайн Granchi Studio 2017 Дизайн Granchi Studio 2017', NULL, 'Sigma L2', '350.00', '7502.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(93, 1, 0, 'CL 1869/1', 'Деревянная лакированная лампа с бронзовой отделкой черный лак. Настольные лампы. Дизайн Simone Granchi 2007. PINK & BLACK Дизайн Simone Granchi 2007. PINK & BLACK', NULL, 'Sigma L2', '140.00', '7504.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(94, 1, 0, 'CL2083', 'Настольная лампа в майолике ручной работы. Пергаментный абажур.. Настольные лампы. Дизайн Granchi Studio 2017 Дизайн Granchi Studio 2017', NULL, 'Sigma L2', '150.00', '7502.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(95, 1, 0, '1724/1', 'отделка- dekapè oro. Настольные лампы.', NULL, 'Sigma L2', '84.00', '5642.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(96, 1, 0, '1724/2', 'отделка- dekapè oro. Настольные лампы.', NULL, 'Sigma L2', '160.00', NULL, NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(97, 1, 0, 'TM0046', 'Латунь. Настольные лампы. Классический', NULL, 'Vaughan', '56.00', '3654.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23'),
(98, 1, 0, 'TM0036', 'Латунь ткань. Настольные лампы. Классический', NULL, 'Vaughan', '410.00', '3655.jpg', NULL, '2023-07-16 17:28:23', '2023-07-16 17:28:23');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `products_category_id_foreign` (`category_id`),
  ADD KEY `products_discount_id_foreign` (`discount_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=99;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`),
  ADD CONSTRAINT `products_discount_id_foreign` FOREIGN KEY (`discount_id`) REFERENCES `discounts` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
